[
  {
    "title": "How I Grow Tomatoes Indoors",
    "plantType": "Tomato",
    "difficulty": "Medium",
    "description": "I grow tomatoes indoors by setting up grow lights near a sunny window, choosing dwarf tomato varieties, and using large containers filled with organic potting mix. I water them consistently, ensure good air circulation, and support them with small cages or stakes. Pollination is done manually by gently shaking the plants or using a soft brush. This method helps me enjoy fresh, juicy tomatoes year-round, even in limited indoor space.",
    "image": "https://i.ibb.co/YTw5LmwG/sara-tomato.jpg",
    "category": "Plant Care",
    "availability": "Public",
    "user": {
      "email": "sara@gardenhub.com",
      "name": "Sara Bloom"
    },
    "totalLike": 0
  },
  {
    "title": "Beginner's Guide to Composting",
    "plantType": "General",
    "difficulty": "Easy",
    "description": "To start composting, I collect kitchen scraps like fruit peels, vegetable cuttings, and coffee grounds, and combine them with dry materials like leaves, cardboard, and shredded newspaper. I use a compost bin in my backyard and turn the pile regularly to keep it aerated. After a few weeks, the mixture breaks down into rich, dark compost that I use in my garden to improve soil quality and reduce waste.",
    "image": "https://i.ibb.co/DgKPW5D6/composting.jpg",
    "category": "Composting",
    "availability": "Public",
    "user": {
      "email": "john@gardenhub.com",
      "name": "John Green"
    },
    "totalLike": 0
  },
  {
    "title": "Maximize Your Space with Vertical Gardening",
    "plantType": "Herbs",
    "difficulty": "Medium",
    "description": "I use vertical gardening to grow herbs and small vegetables in a compact area by installing vertical planters on my balcony wall. This includes stacked pots, hanging shoe organizers, and wooden pallets. I plant herbs like basil, mint, and parsley, and make sure each tier receives adequate sunlight and water. This method saves space and adds greenery to urban living areas efficiently.",
    "image": "https://i.ibb.co/j9fR8LYD/vertical-gardening.jpg",
    "category": "Vertical Gardening",
    "availability": "Public",
    "user": {
      "email": "maya@gardenhub.com",
      "name": "Maya Fern"
    },
    "totalLike": 0
  },
  {
    "title": "How to Care for Your Snake Plant",
    "plantType": "Snake Plant",
    "difficulty": "Easy",
    "description": "Snake plants are low-maintenance and thrive with minimal care. I place mine in indirect sunlight and water them once every 2–3 weeks, allowing the soil to dry between waterings. They tolerate low light and neglect, making them perfect for beginners. Occasionally, I wipe the leaves to keep them dust-free and check for signs of overwatering to avoid root rot.",
    "image": "https://i.ibb.co/ym2MHBZS/snake-plant.jpg",
    "category": "Plant Care",
    "availability": "Public",
    "user": {
      "email": "alex@gardenhub.com",
      "name": "Alex Leaf"
    },
    "totalLike": 0
  },
  {
    "title": "Growing Strawberries in Hanging Baskets",
    "plantType": "Strawberry",
    "difficulty": "Medium",
    "description": "I grow strawberries in hanging baskets by choosing compact, everbearing varieties. I fill the baskets with rich, well-draining potting soil and place them where they get at least 6 hours of sunlight. Regular watering and monthly feeding help keep the plants healthy. Hanging baskets save space and protect the fruits from pests, allowing for easy harvesting on balconies or patios.",
    "image": "https://i.ibb.co/C5MrQks0/strawberry.jpg",
    "category": "Container Gardening",
    "availability": "Public",
    "user": {
      "email": "linda@gardenhub.com",
      "name": "Linda Berry"
    },
    "totalLike": 0
  },
  {
    "title": "DIY Organic Fertilizer Mix at Home",
    "plantType": "General",
    "difficulty": "Easy",
    "description": "I prepare organic fertilizer at home by mixing natural ingredients such as banana peels, crushed eggshells, coffee grounds, and wood ash. These ingredients provide essential nutrients like potassium, calcium, nitrogen, and phosphorus. I dry them, grind into a fine powder, and sprinkle it into the soil or mix with water to create a liquid feed. This method helps my plants grow healthily without chemical-based fertilizers.",
    "image": "https://i.ibb.co/pv79Tvq3/fertilize.jpg",
    "category": "Composting",
    "availability": "Public",
    "user": {
      "email": "kevin@gardenhub.com",
      "name": "Kevin Sprout"
    },
    "totalLike": 0
  }
]
